[
 {
   "noTeamComponent": {
     "jql": "project = Quarkus AND (component not in ('team/eng', 'team/cee', 'team/docs', 'team/ibm', 'team/mktg', 'team/pm', 'team/pgm', 'team/prod', 'team/qe') OR component is EMPTY) AND status != closed",
     "description": "Issue has no Team component. Please update the 'component/s' field with one (or more) of: 'team/eng', 'team/cee', 'team/docs', 'team/ibm', 'team/mktg', 'team/pm', 'team/pgm', 'team/prod', 'team/qe'"
   }
 },
 {
   "noAssigneeWhenInProgress": {
     "jql": "project = Quarkus AND status in ('Analysis in Progress', 'Dev In Progress') AND assignee is EMPTY ",
     "description": "Issue is marked as in progress, but there is no assignee. The assignee should be set to the primary person who is working on this"
   }
 },
 {
   "erroneousLabel": {
     "jql": "project = Quarkus AND labels in ('Eng,', 'CEE,', 'Docs,', 'IBM,', 'Marketing,', 'PM,', 'PgM,', 'Prod,', 'QE,')",
     "description": "This issue appears to be using a label with a typo. Notice the ',' after one of the labels. This is a problem, as the erroneous label appears as an option in autocomplete, encouraging further errors. Please can you update it to remove the ',' character?"
   }
 },
 {
   "missingVersion": {
     "jql": "project = Quarkus AND fixVersion is EMPTY AND status not in ('To Do', 'Analysis in Progress', 'closed') AND (component not in (code.quarkus) or component is Empty)",
     "description": "This issue is in progress or completed so should have a fixVersion set. Please set the fix version, or reply to this email if you are unsure what fix version to set"
   }
 },
 {
   "versionedUpstreamKafkaIssues": {
     "jql": "project = Quarkus AND (fixVersion is NOT EMPTY OR affectedVersion is not EMPTY) AND labels in (upstream-kafka)",
     "description": "Issues with the 'upstream-kafka' label set must not be assigned a fix version or affects version. This is because they represent issues that need to be fixed in the Kafka upstream, rather than a particular RHBoQ code release"
   }
 },
 {
   "missingGA": {
     "jql": "project = quarkus and fixVersion !~ '*.ga' AND fixVersion != 'Ongoing Prod' AND fixVersion != 'Ongoing Registry' AND component not in (platform)",
     "description": "This issue seems to have a fixVersion set to a particular product release, but is missing the GA release it targets. Please respond to this email if you are unure what GA release to add to the fixVersion field."
   }
 },
 {
   "OpenOrVersionedDuplicate": {
     "jql": "project = QUARKUS AND resolution = 'Duplicate Issue' AND (status not in (Closed) or fixVersion is not EMPTY)",
     "description": "Duplicate issues should be in the 'Closed' status and not be assigned to a FixVersion. This ensures that they don't clutter up reports. Please fix this be ensuring the issue is in the 'Closed' status and that the 'Fix Version/s' field is empty"
   }
 }
]
